       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 YYYYMMDD PIC 9(8).
       01 INTEGER-FORM PIC S9(9).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            MOVE FUNCTION CURRENT-DATE(1:8) TO YYYYMMDD

            DISPLAY "Today is: " YYYYMMDD

            COMPUTE INTEGER-FORM = FUNCTION INTEGER-OF-DATE(YYYYMMDD)
            ADD 90 TO INTEGER-FORM

            COMPUTE YYYYMMDD = FUNCTION DATE-OF-INTEGER(INTEGER-FORM)
            DISPLAY "90 days from now: " YYYYMMDD
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
