       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIRST-PROGRAMM.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 FULLNAME.
            05 FIRST-NAME PIC X(20).
            05 FILLER     PIC X VALUE SPACE.
            05 LAST-NAME  PIC X(20).
       PROCEDURE DIVISION.
           DISPLAY "FIRST NAME: "
           ACCEPT FIRST-NAME
           DISPLAY "LAST-NAME"
           ACCEPT LAST-NAME

           DISPLAY FULLNAME

           MOVE "TARAS" TO FIRST-NAME
           DISPLAY FULLNAME
           MOVE "SHEVCHENKO" TO LAST-NAME
           DISPLAY FULLNAME

           MOVE "TARAS SHEVCHENKO" TO FULLNAME
           DISPLAY FULLNAME

       GOBACK.
