       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 ITEM-1 PIC X(30) VALUE "HelLo wOrLd!".
       01 ITEM-2 PIC X(30).
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            DISPLAY ITEM-1
            DISPLAY FUNCTION UPPER-CASE(ITEM-1)
            DISPLAY FUNCTION LOWER-CASE(ITEM-1)

            MOVE FUNCTION UPPER-CASE(ITEM-1) TO ITEM-2

            DISPLAY ITEM-1
            DISPLAY ITEM-2
            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
