       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
            PERFORM PRINT-PARAGRAPH.
            PERFORM PRINT-SECTION.
            STOP RUN.
       PRINT-PARAGRAPH.
           DISPLAY "Hello from PRINT-PARAGRAPH"
       .
       PRINT-SECTION.
           DISPLAY "Hello from PRINT-SECTION"
       .

       END PROGRAM YOUR-PROGRAM-NAME.
