       IDENTIFICATION DIVISION.
       PROGRAM-ID. YOUR-PROGRAM-NAME.
       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01 WS-PERSON.
          05 WS-FIRST-NAME PIC X(5) VALUE 'KALAI'.
          05 WS-SPACE      PIC X(1) VALUE SPACE.
          05 WS-LAST-NAME  PIC X(5) VALUE 'SRINI'.
          05 WS-AGE        PIC 9(2) VALUE 25.
      *> --- RENAMES: Name + Las name ) ---
       66 WS-FULL-NAME RENAMES WS-FIRST-NAME THRU WS-LAST-NAME.
       01 WS-PERSON-RAW REDEFINES WS-PERSON PIC X(13).

       PROCEDURE DIVISION.
       MAIN-PROCEDURE.
           DISPLAY "FULL RECORD: " WS-PERSON-RAW
           DISPLAY "FIRST NAME: " WS-FIRST-NAME
           DISPLAY "LAST NAME : " WS-LAST-NAME
           DISPLAY "AGE       : " WS-AGE

           MOVE "IVAN  PETROV30" TO WS-PERSON-RAW

           DISPLAY "---- AFTER REDEFINES MOVE ----"
           DISPLAY "FIRST NAME: " WS-FIRST-NAME
           DISPLAY "LAST NAME : " WS-LAST-NAME
           DISPLAY "AGE       : " WS-AGE

           IF WS-FULL-NAME = "IVAN  PETROV"
               DISPLAY "NAME MATCHED"
           END-IF

            STOP RUN.
       END PROGRAM YOUR-PROGRAM-NAME.
